views/surat-disposisi/_form.php


     <div class="form-group">
        <label>Nomor Surat </label>
        <?= Html::activeDropDownList($model,'no_agenda_masuk', ArrayHelper::map(SuratMasuk::find()->all(),'no_agenda_masuk','no_surat_masuk'),
        ['class' =>'form-control']) ?>
---
SELECT * FROM `surat_masuk`


     <div class="form-group">
        <label>Asal Surat</label>
        <?= Html::activeDropDownList($model,'no_agenda_masuk', ArrayHelper::map(SuratMasuk::find()->all(),'no_agenda_masuk','asal_surat'),
        ['class' =>'form-control']) ?>
---
SELECT * FROM `surat_masuk`


     <div class="form-group">
        <label>Perihal Surat </label>
        <?= Html::activeDropDownList($model,'id_klasifikasi', ArrayHelper::map(Klasifikasi::find()->all(),'id_klasifikasi','nama_klasifikasi'),
        ['class' =>'form-control']) ?>
---
SELECT * FROM `klasifikasi`