controllers/SuratDisposisiController.php

SELECT * FROM `jabatan`
---
    public function actionCreate()
    {

       // print_r('expression');exit();
        $databaru = Jabatan::find()->all();

SELECT * FROM `jabatan`
---
    public function actionPrint($id) {
     $model = $this->findModel($id);
     $jabatan = Jabatan::find()->all();